Improved docs and added implementation details
